app/Http/Livewire/MetaEditor.php

select `name`, `id` from `lo_vehicle-bodies` where `lo_vehicle-bodies`.`deleted_at` is null order by `created_at` desc
---
    public function mount()
    {
        $this->metadata = VehicleMeta::where('type', $this->metatype)->get();
        $this->models = VehicleModel::orderBy('name')->get();