app/Helpers/Helper.php

select `role` from `lo_users` where `id` = 17 limit 1
---
    public static function roleCheck($user_id) {
        $user_role = DB::table('users')
            ->select('role')
            ->where('id', $user_id)
            ->first();