app/Http/Controllers/DashboardController.php

    public static function GetOrdersByVehicleStatus($status)
    {
        if (Auth::user()->role != 'admin') {
            $searchField = Auth::user()->role . '_id';

            $orders = Order::whereHas('vehicle', function ($q) use ($status) {
                $q->where('vehicle_status', $status);
            })->where($searchField, Auth::user()->company_id);
---
select count(*) as aggregate from `lo_order` where `vehicle_status` = 2 and `lo_order`.`deleted_at` is null