app/Http/Controllers/ManufacturerController.php

insert into `lo_manufacturers` (`name`, `slug`, `models`, `updated_at`, `created_at`) values ('Acura', 'acura', '[\"RLX\",\"TLX\",\"MDX\",\"RDX\",\"MDX Sport Hybrid\",\"RLX Sport Hybrid\",\"NSX\",\"ILX\",\"TSX\",\"TL\",\"ZDX\",\"RL\",\"RSX\",\"CL\",\"Integra\",\"SLX\",\"Legend\",\"Vigor\"]', '2021-04-30 09:42:49', '2021-04-30 09:42:49')
---
    public function buildManufacturerTable()
    {
        $data = json_decode( file_get_contents ( asset('storage/manufacturer-data.json') ) );

        foreach ( $data as $make ) {
            $man = new Manufacturer();

            $man->name = $make->name;
            $man->slug = Str::slug( $make->name, '-' );
            $man->models = json_encode($make->models);

            $man->save();