app/Http/Controllers/MessagesController.php

    public static function getUnreadMessages($limit, $user_id) {
        $unread_messages = Message::select('message.message_group_id', 'message_group.subject', 'message.created_at', 'users.firstname')
            ->leftJoin('message_group', 'message_group.id', 'message.message_group_id')
            ->leftJoin('users', 'users.id', 'message.sender_id')
            ->where('recipient_id', $user_id)
            ->where('recipient_read_at', null)
            ->orderBy('message.created_at', 'desc')
            ->groupBy('message.message_group_id')
            ->limit($limit)
            ->get();
---
select `lo_message`.`message_group_id`, `lo_message_group`.`subject`, `lo_message`.`created_at`, `lo_users`.`firstname` from `lo_message` left join `lo_message_group` on `lo_message_group`.`id` = `lo_message`.`message_group_id` left join `lo_users` on `lo_users`.`id` = `lo_message`.`sender_id` where `recipient_id` = 17 and `recipient_read_at` is null group by `lo_message`.`message_group_id` order by `lo_message`.`created_at` desc limit 4

    public static function getAllUnreadMessages($user_id) {
        $all_unread_messages = Message::select('message.message_group_id')
            ->where('recipient_id', $user_id)
            ->where('recipient_read_at', null)
            ->orderBy('message.created_at', 'desc')
            ->groupBy('message.message_group_id')
            ->get();
---
select `lo_message`.`message_group_id` from `lo_message` where `recipient_id` = 17 and `recipient_read_at` is null group by `lo_message`.`message_group_id` order by `lo_message`.`created_at` desc