app/Http/Controllers/OrdersController.php

select `field_name`, `field_value` from `lo_order_option_excludes` where `field_name` = 'vehicle_make' and `field_value` = '' limit 1
---
    public static function getFieldValues($field_name)
    {
        $values = DB::table('order')
            ->select($field_name . ' as value')
            ->groupBy('value')
            ->get();

        $viable_values = [];
        foreach ($values as $record) {
            $check = DB::table('order_option_excludes')
                ->select('field_name', 'field_value')
                ->where('field_name', $field_name)
                ->where('field_value', $record->value)
                ->first();

select * from `lo_companies` where `company_type` = 'broker' and `lo_companies`.`deleted_at` is null
---
    public static function getCompanyInfo($type)
    {
        $company_info = Company::where('company_type', $type)->get();

select * from `lo_manufacturers` order by `created_at` desc
select * from `lo_invoice_companies` order by `name` asc
select * from `lo_registration_companies` order by `name` asc
---
    protected function OrderDetails($id = null)
    {
        $manufacturers = Manufacturer::latest()->get();

        $order = new OrderLegacy();
        $editMode = false;
        $route = 'add_order';
        $dealer_fit_options = [];
        $factory_fit_options = [];
        $attachments = [];
        $title = 'Create Order';
        $activePage = 'create-order';

        if ($id) {
            $order = OrderLegacy::find($id);
            $route = 'order.update';
            $editMode = true;
            $dealer_fit_options = $this->getOrderFitOptions($order->id, 'factory');
            $factory_fit_options = $this->getOrderFitOptions($order->id, 'dealer');
            $attachments = $this->getAttachments($order->id);
            $title = 'Edit Order';
            $activePage = 'edit-order';
        }

        return [
            'title' => $title,
            'activePage' => $activePage,
            'edit_mode' => $editMode,
            'post_route' => $route,
            'order_details' => $order,
            'attachments' => $attachments,
            'factory_fit_options' => $dealer_fit_options,
            'dealer_fit_options' => $factory_fit_options,
            'invoice_companies' => InvoiceCompany::orderBy('name')->get(),
            'registration_companies' => RegistrationCompany::orderBy('name')->get(),
            'factory_options' => $this->getFitOptions('factory', $id),
            'dealer_options' => $this->getFitOptions('dealer', $id),
            'manufacturers' => $manufacturers
        ];

insert into `lo_order_option_excludes` (`field_name`, `field_value`, `created_at`) values ('vehicle_make', '4', '2021-04-30 10:23:42')
---
    public function executeAddExcludeField(Request $request)
    {
        $field_name = $request->get('fieldName');
        $field_value = $request->get('fieldValue');

        DB::table('order_option_excludes')->insert([
            'field_name' => $field_name,
            'field_value' => $field_value,
            'created_at' => Carbon::now()
        ]);